Repository: rafapoza/medicapp
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# navMedication
source: Medication
ca: Medicació
es: Medicación

# navPillOrganizer
source: Pill Organizer
ca: Pastiller
es: Pastillero

# navMedicineCabinet
source: Medicine Cabinet
ca: Farmaciola
es: Botiquín

# navHistory
source: History
ca: Historial
es: Historial

# navSettings
source: Settings
ca: Configuració
es: Configuración

# navInventory
source: Inventory
ca: Inventari
es: Inventario

# navMedicationShort
source: Home
ca: Inici
es: Inicio

# navMedicineCabinetShort
source: Cabinet
ca: Farmaciola
es: Botiquín

# navHistoryShort
source: History
ca: Historial
es: Historial

# navSettingsShort
source: Settings
ca: Ajustos
es: Ajustes

# navInventoryShort
source: Meds
ca: Medicines
es: Medicinas

# btnContinue
source: Continue
ca: Continuar
es: Continuar

# btnBack
source: Back
ca: Enrere
es: Atrás

# btnSave
source: Save
ca: Desar
es: Guardar

# btnCancel
source: Cancel
ca: Cancel·lar
es: Cancelar

# btnDelete
source: Delete
ca: Eliminar
es: Eliminar

# btnEdit
source: Edit
ca: Editar
es: Editar

# btnClose
source: Close
ca: Tancar
es: Cerrar

# btnConfirm
source: Confirm
ca: Confirmar
es: Confirmar

# btnAccept
source: Accept
ca: Acceptar
es: Aceptar

# medicationTypePill
source: Pill
ca: Pastilla
es: Pastilla

# medicationTypeCapsule
source: Capsule
ca: Càpsula
es: Cápsula

# medicationTypeTablet
source: Tablet
ca: Comprimit
es: Comprimido

# medicationTypeSyrup
source: Syrup
ca: Xarop
es: Jarabe

# medicationTypeDrops
source: Drops
ca: Gotes
es: Gotas

# medicationTypeInjection
source: Injection
ca: Injecció
es: Inyección

# medicationTypePatch
source: Patch
ca: Pegat
es: Parche

# medicationTypeInhaler
source: Inhaler
ca: Inhalador
es: Inhalador

# medicationTypeCream
source: Cream
ca: Crema
es: Crema

# medicationTypeOther
source: Other
ca: Altre
es: Otro

# doseStatusTaken
source: Taken
ca: Presa
es: Tomada

# doseStatusSkipped
source: Skipped
ca: Omesa
es: Omitida

# doseStatusPending
source: Pending
ca: Pendent
es: Pendiente

# durationContinuous
source: Continuous
ca: Continu
es: Continuo

# durationSpecificDates
source: Specific Dates
ca: Dates específiques
es: Fechas específicas

# durationAsNeeded
source: As Needed
ca: Segons necessitat
es: Según necesidad

# mainScreenTitle
source: My Medications
ca: Els meus medicaments
es: Mis Medicamentos

# mainScreenEmptyTitle
source: No medications registered
ca: No hi ha medicaments registrats
es: No hay medicamentos registrados

# mainScreenEmptySubtitle
source: Add medications using the + button
ca: Afegeix medicaments utilitzant el botó +
es: Añade medicamentos usando el botón +

# mainScreenTodayDoses
source: Today's Doses
ca: Preses d'avui
es: Tomas de hoy

# mainScreenNoMedications
source: You don't have active medications
ca: No tens medicaments actius
es: No tienes medicamentos activos

# msgMedicationAdded
source: Medication added successfully
ca: Medicament afegit correctament
es: Medicamento añadido correctamente

# msgMedicationUpdated
source: Medication updated successfully
ca: Medicament actualitzat correctament
es: Medicamento actualizado correctamente

# msgMedicationDeleted
source: {name} deleted successfully
ca: {name} eliminat correctament
es: {name} eliminado correctamente

# validationRequired
source: This field is required
ca: Aquest camp és obligatori
es: Este campo es obligatorio

# validationDuplicateMedication
source: This medication already exists in your list
ca: Aquest medicament ja existeix a la teva llista
es: Este medicamento ya existe en tu lista

# validationInvalidNumber
source: Enter a valid number
ca: Introdueix un número vàlid
es: Introduce un número válido

# validationMinValue
source: Value must be greater than {min}
ca: El valor ha de ser major que {min}
es: El valor debe ser mayor que {min}

# pillOrganizerTitle
source: Pill Organizer
ca: Pastiller
es: Pastillero

# pillOrganizerLowStock
source: Low stock
ca: Estoc baix
es: Stock bajo

# pillOrganizerNoStock
source: No stock
ca: Sense estoc
es: Sin stock

# pillOrganizerAvailableStock
source: Available stock
ca: Estoc disponible
es: Stock disponible

# pillOrganizerMedicationsTitle
source: Medications
ca: Medicaments
es: Medicamentos

# pillOrganizerEmptyTitle
source: No medications registered
ca: No hi ha medicaments registrats
es: No hay medicamentos registrados

# pillOrganizerEmptySubtitle
source: Add medications to view your pill organizer
ca: Afegeix medicaments per veure el teu pastiller
es: Añade medicamentos para ver tu pastillero

# pillOrganizerCurrentStock
source: Current stock
ca: Estoc actual
es: Stock actual

# pillOrganizerEstimatedDuration
source: Estimated duration
ca: Durada estimada
es: Duración estimada

# pillOrganizerDays
source: days
ca: dies
es: días

# medicineCabinetTitle
source: Medicine Cabinet
ca: Farmaciola
es: Botiquín

# medicineCabinetSearchHint
source: Search medication...
ca: Buscar medicament...
es: Buscar medicamento...

# medicineCabinetEmptyTitle
source: No medications registered
ca: No hi ha medicaments registrats
es: No hay medicamentos registrados

# medicineCabinetEmptySubtitle
source: Add medications to view your medicine cabinet
ca: Afegeix medicaments per veure la teva farmaciola
es: Añade medicamentos para ver tu botiquín

# medicineCabinetPullToRefresh
source: Pull down to refresh
ca: Arrossega cap avall per recarregar
es: Arrastra hacia abajo para recargar

# medicineCabinetNoResults
source: No medications found
ca: No s'han trobat medicaments
es: No se encontraron medicamentos

# medicineCabinetNoResultsHint
source: Try another search term
ca: Prova amb un altre terme de cerca
es: Prueba con otro término de búsqueda

# medicineCabinetSuspended
source: Suspended
ca: Suspès
es: Suspendido

# medicineCabinetTapToRegister
source: Tap to register
ca: Toca per registrar
es: Toca para registrar

# medicineCabinetResumeMedication
source: Resume medication
ca: Reprendre medicació
es: Reanudar medicación

# medicineCabinetRegisterDose
source: Register dose
ca: Registrar presa
es: Registrar toma

# medicineCabinetRefillMedication
source: Refill medication
ca: Recarregar medicament
es: Recargar medicamento

# medicineCabinetEditMedication
source: Edit medication
ca: Editar medicament
es: Editar medicamento

# medicineCabinetDeleteMedication
source: Delete medication
ca: Eliminar medicament
es: Eliminar medicamento

# medicineCabinetRefillTitle
source: Refill {name}
ca: Recarregar {name}
es: Recargar {name}

# medicineCabinetRegisterDoseTitle
source: Register dose of {name}
ca: Registrar presa de {name}
es: Registrar toma de {name}

# medicineCabinetCurrentStock
source: Current stock:
ca: Estoc actual:
es: Stock actual:

# medicineCabinetAddQuantity
source: Quantity to add:
ca: Quantitat a afegir:
es: Cantidad a añadir:

# medicineCabinetAddQuantityLabel
source: Quantity to add
ca: Quantitat a agregar
es: Cantidad a agregar

# medicineCabinetExample
source: Ex:
es: Ej:

# medicineCabinetLastRefill
source: Last refill:
ca: Última recàrrega:
es: Última recarga:

# medicineCabinetRefillButton
source: Refill
ca: Recarregar
es: Recargar

# medicineCabinetAvailableStock
source: Available stock:
ca: Estoc disponible:
es: Stock disponible:

# medicineCabinetDoseTaken
source: Quantity taken
ca: Quantitat presa
es: Cantidad tomada

# medicineCabinetRegisterButton
source: Register
ca: Registrar
es: Registrar

# medicineCabinetNewStock
source: New stock:
ca: Nou estoc:
es: Nuevo stock:

# medicineCabinetDeleteConfirmTitle
source: Delete medication
ca: Eliminar medicament
es: Eliminar medicamento

# medicineCabinetDeleteConfirmMessage
source: Are you sure you want to delete "{name}"? This action cannot be undone and all history for this medication will be lost.
ca: Estàs segur que vols eliminar "{name}"? Aquesta acció no es pot desfer i es perdrà tot l'historial d'aquest medicament.
es: ¿Estás seguro de que deseas eliminar "{name}"? Esta acción no se puede deshacer y se perderá todo el historial de este medicamento.

# medicineCabinetNoStockAvailable
source: No stock available for this medication
ca: No hi ha estoc disponible d'aquest medicament
es: No hay stock disponible de este medicamento

# medicineCabinetInsufficientStock
source: Insufficient stock for this dose Needed: {needed} {unit} Available: {available}
ca: Estoc insuficient per aquesta presa Necessites: {needed} {unit} Disponible: {available}
es: Stock insuficiente para esta toma Necesitas: {needed} {unit} Disponible: {available}

# medicineCabinetRefillSuccess
source: Stock of {name} refilled Added: {amount} {unit} New stock: {newStock}
ca: Estoc de {name} recarregat Afegit: {amount} {unit} Nou estoc: {newStock}
es: Stock de {name} recargado Agregado: {amount} {unit} Nuevo stock: {newStock}

# medicineCabinetDoseRegistered
source: Dose of {name} registered Quantity: {amount} {unit} Remaining stock: {remaining}
ca: Presa de {name} registrada Quantitat: {amount} {unit} Estoc restant: {remaining}
es: Toma de {name} registrada Cantidad: {amount} {unit} Stock restante: {remaining}

# medicineCabinetDeleteSuccess
source: {name} deleted successfully
ca: {name} eliminat correctament
es: {name} eliminado correctamente

# medicineCabinetResumeSuccess
source: {name} resumed successfully Notifications rescheduled
ca: {name} reprès correctament Notificacions reprogramades
es: {name} reanudado correctamente Notificaciones reprogramadas

# doseHistoryTitle
source: Dose History
ca: Historial de preses
es: Historial de Tomas

# doseHistoryFilterTitle
source: Filter history
ca: Filtrar historial
es: Filtrar historial

# doseHistoryMedicationLabel
source: Medication:
ca: Medicament:
es: Medicamento:

# doseHistoryAllMedications
source: All medications
ca: Tots els medicaments
es: Todos los medicamentos

# doseHistoryDateRangeLabel
source: Date range:
ca: Rang de dates:
es: Rango de fechas:

# doseHistoryClearDates
source: Clear dates
ca: Netejar dates
es: Limpiar fechas

# doseHistoryApply
source: Apply
ca: Aplicar
es: Aplicar

# doseHistoryTaken
source: Taken
ca: Preses
es: Tomadas

# doseHistorySkipped
source: Skipped
ca: Omeses
es: Omitidas

# doseHistoryClear
source: Clear
ca: Netejar
es: Limpiar

# doseHistoryEditEntry
source: Edit {name} record
ca: Editar registre de {name}
es: Editar registro de {name}

# doseHistoryScheduledTime
source: Scheduled time:
ca: Hora programada:
es: Hora programada:

# doseHistoryActualTime
source: Actual time:
ca: Hora real:
es: Hora real:

# doseHistoryStatus
source: Status:
ca: Estat:
es: Estado:

# doseHistoryMarkAsSkipped
source: Mark as Skipped
ca: Marcar com a omesa
es: Marcar como Omitida

# doseHistoryMarkAsTaken
source: Mark as Taken
ca: Marcar com a presa
es: Marcar como Tomada

# doseHistoryConfirmDelete
source: Confirm deletion
ca: Confirmar eliminació
es: Confirmar eliminación

# doseHistoryConfirmDeleteMessage
source: Are you sure you want to delete this record?
ca: Estàs segur que vols eliminar aquest registre?
es: ¿Estás seguro de que quieres eliminar este registro?

# doseHistoryRecordDeleted
source: Record deleted successfully
ca: Registre eliminat correctament
es: Registro eliminado correctamente

# doseHistoryDeleteError
source: Error deleting: {error}
ca: Error en eliminar: {error}
es: Error al eliminar: {error}

# addMedicationTitle
source: Add Medication
ca: Afegir medicament
es: Añadir Medicamento

# stepIndicator
source: Step {current} of {total}
ca: Pas {current} de {total}
es: Paso {current} de {total}

# medicationInfoTitle
source: Medication information
ca: Informació del medicament
es: Información del medicamento

# medicationInfoSubtitle
source: Start by providing the medication name and type
ca: Comença proporcionant el nom i tipus de medicament
es: Comienza proporcionando el nombre y tipo de medicamento

# medicationNameLabel
source: Medication name
ca: Nom del medicament
es: Nombre del medicamento

# medicationNameHint
source: E.g.: Paracetamol
ca: Ex: Paracetamol
es: Ej: Paracetamol

# medicationTypeLabel
source: Medication type
ca: Tipus de medicament
es: Tipo de medicamento

# validationMedicationName
source: Please enter the medication name
ca: Si us plau, introdueix el nom del medicament
es: Por favor, introduce el nombre del medicamento

# medicationDurationTitle
source: Treatment Type
ca: Tipus de tractament
es: Tipo de Tratamiento

# medicationDurationSubtitle
source: How will you take this medication?
ca: Com prendràs aquest medicament?
es: ¿Cómo vas a tomar este medicamento?

# durationContinuousTitle
source: Continuous treatment
ca: Tractament continu
es: Tratamiento continuo

# durationContinuousDesc
source: Every day, with regular pattern
ca: Tots els dies, amb patró regular
es: Todos los días, con patrón regular

# durationUntilEmptyTitle
source: Until medication runs out
ca: Fins acabar medicació
es: Hasta acabar medicación

# durationUntilEmptyDesc
source: Ends when stock is depleted
ca: Acaba quan s'acabi l'estoc
es: Termina cuando se acabe el stock

# durationSpecificDatesTitle
source: Specific dates
ca: Dates específiques
es: Fechas específicas

# durationSpecificDatesDesc
source: Only selected specific days
ca: Només dies concrets seleccionats
es: Solo días concretos seleccionados

# durationAsNeededTitle
source: As-needed medication
ca: Medicament ocasional
es: Medicamento ocasional

# durationAsNeededDesc
source: Only when necessary, no schedules
ca: Només quan sigui necessari, sense horaris
es: Solo cuando sea necesario, sin horarios

# selectDatesButton
source: Select dates
ca: Seleccionar dates
es: Seleccionar fechas

# selectDatesTitle
source: Select the dates
ca: Selecciona les dates
es: Selecciona las fechas

# selectDatesSubtitle
source: Choose the exact days you will take the medication
ca: Tria els dies exactes en què prendràs el medicament
es: Elige los días exactos en los que tomarás el medicamento

# dateSelected
source: {count, plural, =1{1 date selected} other{{count} dates selected}}
ca: {count, plural, =1{1 data seleccionada} other{{count} dates seleccionades}}
es: {count, plural, =1{1 fecha seleccionada} other{{count} fechas seleccionadas}}

# validationSelectDates
source: Please select at least one date
ca: Si us plau, selecciona almenys una data
es: Por favor, selecciona al menos una fecha

# medicationDatesTitle
source: Treatment Dates
ca: Dates del tractament
es: Fechas del Tratamiento

# medicationDatesSubtitle
source: When will you start and end this treatment?
ca: Quan començaràs i acabaràs aquest tractament?
es: ¿Cuándo comenzarás y terminarás este tratamiento?

# medicationDatesHelp
source: Both dates are optional. If you don't set them, the treatment will start today and have no end date.
ca: Ambdues dates són opcionals. Si no les estableixes, el tractament començarà avui i no tindrà data límit.
es: Ambas fechas son opcionales. Si no las estableces, el tratamiento comenzará hoy y no tendrá fecha límite.

# startDateLabel
source: Start date
ca: Data d'inici
es: Fecha de inicio

# startDateOptional
source: Optional
ca: Opcional
es: Opcional

# startDateDefault
source: Starts today
ca: Comença avui
es: Empieza hoy

# endDateLabel
source: End date
ca: Data de fi
es: Fecha de fin

# endDateDefault
source: No end date
ca: Sense data límit
es: Sin fecha límite

# startDatePickerTitle
source: Treatment start date
ca: Data d'inici del tractament
es: Fecha de inicio del tratamiento

# endDatePickerTitle
source: Treatment end date
ca: Data de fi del tractament
es: Fecha de fin del tratamiento

# startTodayButton
source: Start today
ca: Començar avui
es: Empezar hoy

# noEndDateButton
source: No end date
ca: Sense data límit
es: Sin fecha límite

# treatmentDuration
source: {days}-day treatment
ca: Tractament de {days} dies
es: Tratamiento de {days} días

# medicationFrequencyTitle
source: Medication Frequency
ca: Freqüència de medicació
es: Frecuencia de Medicación

# medicationFrequencySubtitle
source: How often should you take this medication
ca: Cada quants dies has de prendre aquest medicament
es: Cada cuántos días debes tomar este medicamento

# frequencyDailyTitle
source: Every day
ca: Tots els dies
es: Todos los días

# frequencyDailyDesc
source: Continuous daily medication
ca: Medicació diària contínua
es: Medicación diaria continua

# frequencyAlternateTitle
source: Alternate days
ca: Dies alternats
es: Días alternos

# frequencyAlternateDesc
source: Every 2 days from treatment start
ca: Cada 2 dies des de l'inici del tractament
es: Cada 2 días desde el inicio del tratamiento

# frequencyWeeklyTitle
source: Specific days of the week
ca: Dies de la setmana específics
es: Días de la semana específicos

# frequencyWeeklyDesc
source: Select which days to take the medication
ca: Selecciona quins dies prendre el medicament
es: Selecciona qué días tomar el medicamento

# selectWeeklyDaysButton
source: Select days
ca: Seleccionar dies
es: Seleccionar días

# selectWeeklyDaysTitle
source: Days of the week
ca: Dies de la setmana
es: Días de la semana

# selectWeeklyDaysSubtitle
source: Select the specific days you will take the medication
ca: Selecciona els dies específics en què prendràs el medicament
es: Selecciona los días específicos en los que tomarás el medicamento

# daySelected
source: {count, plural, =1{1 day selected} other{{count} days selected}}
ca: {count, plural, =1{1 dia seleccionat} other{{count} dies seleccionats}}
es: {count, plural, =1{1 día seleccionado} other{{count} días seleccionados}}

# validationSelectWeekdays
source: Please select the days of the week
ca: Si us plau, selecciona els dies de la setmana
es: Por favor, selecciona los días de la semana

# medicationDosageTitle
source: Dose Configuration
ca: Configuració de dosis
es: Configuración de Dosis

# medicationDosageSubtitle
source: How do you prefer to configure daily doses?
ca: Com prefereixes configurar les dosis diàries?
es: ¿Cómo prefieres configurar las dosis diarias?

# dosageFixedTitle
source: Same every day
ca: Tots els dies igual
es: Todos los días igual

# dosageFixedDesc
source: Specify how often to take the medication in hours
ca: Especifica cada quantes hores prendre el medicament
es: Especifica cada cuántas horas tomar el medicamento

# dosageCustomTitle
source: Custom
ca: Personalitzat
es: Personalizado

# dosageCustomDesc
source: Define the number of doses per day
ca: Defineix el nombre de preses per dia
es: Define el número de tomas por día

# dosageIntervalLabel
source: Interval between doses
ca: Interval entre preses
es: Intervalo entre tomas

# dosageIntervalHelp
source: The interval must divide 24 exactly
ca: L'interval ha de dividir 24 exactament
es: El intervalo debe dividir 24 exactamente

# dosageIntervalFieldLabel
source: Every how many hours
ca: Cada quantes hores
es: Cada cuántas horas

# dosageIntervalHint
source: E.g.: 8
ca: Ex: 8
es: Ej: 8

# dosageIntervalUnit
source: hours
ca: hores
es: horas

# dosageIntervalValidValues
source: Valid values: 1, 2, 3, 4, 6, 8, 12, 24
ca: Valors vàlids: 1, 2, 3, 4, 6, 8, 12, 24
es: Valores válidos: 1, 2, 3, 4, 6, 8, 12, 24

# dosageTimesLabel
source: Number of doses per day
ca: Nombre de preses al dia
es: Número de tomas al día

# dosageTimesHelp
source: Define how many times a day you'll take the medication
ca: Defineix quantes vegades al dia prendràs el medicament
es: Define cuántas veces al día tomarás el medicamento

# dosageTimesFieldLabel
source: Doses per day
ca: Preses per dia
es: Tomas por día

# dosageTimesHint
source: E.g.: 3
ca: Ex: 3
es: Ej: 3

# dosageTimesUnit
source: doses
ca: preses
es: tomas

# dosageTimesDescription
source: Total number of daily doses
ca: Nombre total de preses diàries
es: Número total de tomas diarias

source: Doses per day
ca: Preses per dia
es: Tomas por día

# doseCount
source: {count, plural, =1{1 dose} other{{count} doses}}
ca: {count, plural, =1{1 presa} other{{count} preses}}
es: {count, plural, =1{1 toma} other{{count} tomas}}

# validationInvalidInterval
source: Please enter a valid interval
ca: Si us plau, introdueix un interval vàlid
es: Por favor, introduce un intervalo válido

# validationIntervalTooLarge
source: The interval cannot be greater than 24 hours
ca: L'interval no pot ser major a 24 hores
es: El intervalo no puede ser mayor a 24 horas

# validationIntervalNotDivisor
source: The interval must divide 24 exactly (1, 2, 3, 4, 6, 8, 12, 24)
ca: L'interval ha de dividir 24 exactament (1, 2, 3, 4, 6, 8, 12, 24)
es: El intervalo debe dividir 24 exactamente (1, 2, 3, 4, 6, 8, 12, 24)

# validationInvalidDoseCount
source: Please enter a valid number of doses
ca: Si us plau, introdueix un nombre de preses vàlid
es: Por favor, introduce un número de tomas válido

# validationTooManyDoses
source: You cannot take more than 24 doses per day
ca: No pots prendre més de 24 dosis al dia
es: No puedes tomar más de 24 dosis al día

# medicationTimesTitle
source: Dose Schedule
ca: Horari de preses
es: Horario de Tomas

# dosesPerDayLabel
source: Doses per day: {count}
ca: Preses al dia: {count}
es: Tomas al día: {count}

# frequencyEveryHours
source: Frequency: Every {hours} hours
ca: Freqüència: Cada {hours} hores
es: Frecuencia: Cada {hours} horas

# selectTimeAndAmount
source: Select the time and amount for each dose
ca: Selecciona l'hora i quantitat de cada presa
es: Selecciona la hora y cantidad de cada toma

source: Dose {number}
ca: Presa {number}
es: Toma {number}

# selectTimeButton
source: Select time
ca: Seleccionar hora
es: Seleccionar hora

source: Amount per dose
ca: Quantitat per presa
es: Cantidad por toma

# amountHint
source: E.g.: 1, 0.5, 2
ca: Ex: 1, 0.5, 2
es: Ej: 1, 0.5, 2

# removeDoseButton
source: Remove dose
ca: Eliminar presa
es: Eliminar toma

# validationSelectAllTimes
source: Please select all dose times
ca: Si us plau, selecciona totes les hores de les preses
es: Por favor, selecciona todas las horas de las tomas

# validationEnterValidAmounts
source: Please enter valid amounts (greater than 0)
ca: Si us plau, introdueix quantitats vàlides (majors a 0)
es: Por favor, ingresa cantidades válidas (mayores a 0)

# validationDuplicateTimes
source: Dose times cannot be repeated
ca: Les hores de les preses no poden repetir-se
es: Las horas de las tomas no pueden repetirse

# validationAtLeastOneDose
source: There must be at least one dose per day
ca: Ha d'haver-hi almenys una presa al dia
es: Debe haber al menos una toma al día

# medicationFastingTitle
source: Fasting Configuration
ca: Configuració de dejuni
es: Configuración de Ayuno

# fastingLabel
source: Fasting
ca: Dejuni
es: Ayuno

# fastingHelp
source: Some medications require fasting before or after taking
ca: Alguns medicaments requereixen dejuni abans o després de la presa
es: Algunos medicamentos requieren ayuno antes o después de la toma

# requiresFastingQuestion
source: Does this medication require fasting?
ca: Aquest medicament requereix dejuni?
es: ¿Este medicamento requiere ayuno?

# fastingYes
source: Yes
ca: Sí
es: Sí

# fastingWhenQuestion
source: When is the fasting?
ca: Quan és el dejuni?
es: ¿Cuándo es el ayuno?

# fastingBefore
source: Before taking
ca: Abans de la presa
es: Antes de la toma

# fastingAfter
source: After taking
ca: Després de la presa
es: Después de la toma

# fastingDurationQuestion
source: How long is the fasting?
ca: Quant temps de dejuni?
es: ¿Cuánto tiempo de ayuno?

# fastingHours
source: Hours
ca: Hores
es: Horas

# fastingMinutes
source: Minutes
ca: Minuts
es: Minutos

# fastingNotificationsQuestion
source: Do you want to receive fasting notifications?
ca: Vols rebre notificacions de dejuni?
es: ¿Deseas recibir notificaciones de ayuno?

# fastingNotificationBeforeHelp
source: We'll notify you when to stop eating before taking
ca: Et notificarem quan hagis de deixar de menjar abans de la presa
es: Te notificaremos cuándo debes dejar de comer antes de la toma
