Repository: rafapoza/medicapp
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# fastingNotificationAfterHelp
source: We'll notify you when you can eat again after taking
ca: Et notificarem quan puguis tornar a menjar després de la presa
es: Te notificaremos cuándo puedes volver a comer después de la toma

# fastingNotificationsOn
source: Notifications enabled
ca: Notificacions activades
es: Notificaciones activadas

# fastingNotificationsOff
source: Notifications disabled
ca: Notificacions desactivades
es: Notificaciones desactivadas

# validationCompleteAllFields
source: Please complete all fields
ca: Si us plau, completa tots els camps
es: Por favor, completa todos los campos

# validationSelectFastingWhen
source: Please select when the fasting is
ca: Si us plau, selecciona quan és el dejuni
es: Por favor, selecciona cuándo es el ayuno

# validationFastingDuration
source: Fasting duration must be at least 1 minute
ca: La durada del dejuni ha de ser almenys 1 minut
es: La duración del ayuno debe ser al menos 1 minuto

# medicationQuantityTitle
source: Medication Quantity
ca: Quantitat de medicament
es: Cantidad de Medicamento

# medicationQuantitySubtitle
source: Set the available quantity and when you want to receive alerts
ca: Estableix la quantitat disponible i quan vols rebre alertes
es: Establece la cantidad disponible y cuándo deseas recibir alertas

# availableQuantityLabel
source: Available quantity
ca: Quantitat disponible
es: Cantidad disponible

# availableQuantityHint
source: E.g.: 30
ca: Ex: 30
es: Ej: 30

# availableQuantityHelp
source: Amount of {unit} you currently have
ca: Quantitat de {unit} que tens actualment
es: Cantidad de {unit} que tienes actualmente

# lowStockAlertLabel
source: Alert when remaining
ca: Avisar quan en quedin
es: Avisar cuando queden

# lowStockAlertHint
source: E.g.: 3
ca: Ex: 3
es: Ej: 3

# lowStockAlertUnit
source: days
ca: dies
es: días

# lowStockAlertHelp
source: Days in advance to receive the low stock alert
ca: Dies d'antelació per rebre l'alerta d'estoc baix
es: Días de antelación para recibir la alerta de bajo stock

# validationEnterQuantity
source: Please enter the available quantity
ca: Si us plau, introdueix la quantitat disponible
es: Por favor, introduce la cantidad disponible

# validationQuantityNonNegative
source: Quantity must be greater than or equal to 0
ca: La quantitat ha de ser major o igual a 0
es: La cantidad debe ser mayor o igual a 0

# validationEnterAlertDays
source: Please enter the days in advance
ca: Si us plau, introdueix els dies d'antelació
es: Por favor, introduce los días de antelación

# validationAlertMinDays
source: Must be at least 1 day
ca: Ha de ser almenys 1 dia
es: Debe ser al menos 1 día

# validationAlertMaxDays
source: Cannot be greater than 30 days
ca: No pot ser major a 30 dies
es: No puede ser mayor a 30 días

# summaryTitle
source: Summary
ca: Resum
es: Resumen

# summaryMedication
source: Medication
ca: Medicament
es: Medicamento

# summaryType
source: Type
ca: Tipus
es: Tipo

# summaryDosesPerDay
source: Doses per day
ca: Preses al dia
es: Tomas al día

# summarySchedules
source: Schedules
ca: Horaris
es: Horarios

# summaryFrequency
source: Frequency
ca: Freqüència
es: Frecuencia

# summaryFrequencyDaily
source: Every day
ca: Tots els dies
es: Todos los días

# summaryFrequencyUntilEmpty
source: Until medication runs out
ca: Fins acabar medicació
es: Hasta acabar medicación

# summaryFrequencySpecificDates
source: {count} specific dates
ca: {count} dates específiques
es: {count} fechas específicas

# summaryFrequencyWeekdays
source: {count} days of the week
ca: {count} dies de la setmana
es: {count} días de la semana

# summaryFrequencyEveryNDays
source: Every {days} days
ca: Cada {days} dies
es: Cada {days} días

# summaryFrequencyAsNeeded
source: As needed
ca: Segons necessitat
es: Según necesidad

# msgMedicationAddedSuccess
source: {name} added successfully
ca: {name} afegit correctament
es: {name} añadido correctamente

# msgMedicationAddError
source: Error saving medication: {error}
ca: Error en desar el medicament: {error}
es: Error al guardar el medicamento: {error}

# saveMedicationButton
source: Save Medication
ca: Desar medicament
es: Guardar Medicamento

# savingButton
source: Saving...
ca: Desant...
es: Guardando...

# doseActionTitle
source: Dose Action
ca: Acció de presa
es: Acción de Toma

# doseActionLoading
source: Loading...
ca: Carregant...
es: Cargando...

# doseActionMedicationNotFound
source: Medication not found
ca: Medicament no trobat
es: Medicamento no encontrado

# doseActionBack
source: Back
ca: Tornar
es: Volver

# doseActionScheduledTime
source: Scheduled time: {time}
ca: Hora programada: {time}
es: Hora programada: {time}

# doseActionThisDoseQuantity
source: This dose quantity
ca: Quantitat d'aquesta presa
es: Cantidad de esta toma

# doseActionWhatToDo
source: What do you want to do?
ca: Què vols fer?
es: ¿Qué deseas hacer?

# doseActionRegisterTaken
source: Register dose
ca: Registrar presa
es: Registrar toma

# doseActionWillDeductStock
source: Will deduct from stock
ca: Descomptarà de l'estoc
es: Descontará del stock

# doseActionMarkAsNotTaken
source: Mark as not taken
ca: Marcar com a no presa
es: Marcar como no tomada

# doseActionWillNotDeductStock
source: Will not deduct from stock
ca: No descomptarà de l'estoc
es: No descontará del stock

# doseActionPostpone15Min
source: Postpone 15 minutes
ca: Posposar 15 minuts
es: Posponer 15 minutos

# doseActionQuickReminder
source: Quick reminder
ca: Recordatori ràpid
es: Recordatorio rápido

# doseActionPostponeCustom
source: Postpone (choose time)
ca: Posposar (triar hora)
es: Posponer (elegir hora)

# doseActionInsufficientStock
source: Insufficient stock for this dose Needed: {needed} {unit} Available: {available}
ca: Estoc insuficient per aquesta presa Necessites: {needed} {unit} Disponible: {available}
es: Stock insuficiente para esta toma Necesitas: {needed} {unit} Disponible: {available}

# doseActionTakenRegistered
source: Dose of {name} registered at {time} Remaining stock: {stock}
ca: Presa de {name} registrada a les {time} Estoc restant: {stock}
es: Toma de {name} registrada a las {time} Stock restante: {stock}

# doseActionSkippedRegistered
source: Dose of {name} marked as not taken at {time} Stock: {stock} (no changes)
ca: Presa de {name} marcada com a no presa a les {time} Estoc: {stock} (sense canvis)
es: Toma de {name} marcada como no tomada a las {time} Stock: {stock} (sin cambios)

# doseActionPostponed
source: Dose of {name} postponed New time: {time}
ca: Presa de {name} posposada Nova hora: {time}
es: Toma de {name} pospuesta Nueva hora: {time}

# doseActionPostponed15
source: Dose of {name} postponed 15 minutes New time: {time}
ca: Presa de {name} posposada 15 minuts Nova hora: {time}
es: Toma de {name} pospuesta 15 minutos Nueva hora: {time}

# editMedicationMenuTitle
source: Edit Medication
ca: Editar medicament
es: Editar Medicamento

# editMedicationMenuWhatToEdit
source: What do you want to edit?
ca: Què vols editar?
es: ¿Qué deseas editar?

# editMedicationMenuSelectSection
source: Select the section you want to modify
ca: Selecciona la secció que vols modificar
es: Selecciona la sección que deseas modificar

# editMedicationMenuBasicInfo
source: Basic Information
ca: Informació bàsica
es: Información Básica

# editMedicationMenuBasicInfoDesc
source: Name and type of medication
ca: Nom i tipus de medicament
es: Nombre y tipo de medicamento

# editMedicationMenuDuration
source: Treatment Duration
ca: Durada del tractament
es: Duración del Tratamiento

# editMedicationMenuFrequency
source: Frequency
ca: Freqüència
es: Frecuencia

# editMedicationMenuSchedules
source: Schedules and Quantities
ca: Horaris i quantitats
es: Horarios y Cantidades

# editMedicationMenuSchedulesDesc
source: {count} doses per day
ca: {count} preses al dia
es: {count} tomas al día

# editMedicationMenuFasting
source: Fasting Configuration
ca: Configuració de dejuni
es: Configuración de Ayuno

# editMedicationMenuQuantity
source: Available Quantity
ca: Quantitat disponible
es: Cantidad Disponible

# editMedicationMenuFreqEveryday
source: Every day
ca: Tots els dies
es: Todos los días

# editMedicationMenuFreqUntilFinished
source: Until medication runs out
ca: Fins acabar medicació
es: Hasta acabar medicación

# editMedicationMenuFreqSpecificDates
source: {count} specific dates
ca: {count} dates específiques
es: {count} fechas específicas

# editMedicationMenuFreqWeeklyDays
source: {count} days of the week
ca: {count} dies de la setmana
es: {count} días de la semana

# editMedicationMenuFreqInterval
source: Every {interval} days
ca: Cada {interval} dies
es: Cada {interval} días

# editMedicationMenuFreqNotDefined
source: Frequency not defined
ca: Freqüència no definida
es: Frecuencia no definida

# editMedicationMenuFastingNone
source: No fasting
ca: Sense dejuni
es: Sin ayuno

# editMedicationMenuFastingDuration
source: Fasting {duration} {type}
ca: Dejuni {duration} {type}
es: Ayuno {duration} {type}

# editMedicationMenuFastingBefore
source: before
ca: abans
es: antes

# editMedicationMenuFastingAfter
source: after
ca: després
es: después

# editBasicInfoTitle
source: Edit Basic Information
ca: Editar informació bàsica
es: Editar Información Básica

# editBasicInfoUpdated
source: Information updated successfully
ca: Informació actualitzada correctament
es: Información actualizada correctamente

# editBasicInfoSaving
source: Saving...
ca: Desant...
es: Guardando...

# editBasicInfoSaveChanges
source: Save Changes
ca: Desar canvis
es: Guardar Cambios

# editBasicInfoError
source: Error saving changes: {error}
ca: Error en desar canvis: {error}
es: Error al guardar cambios: {error}

# editDurationTitle
source: Edit Duration
ca: Editar durada
es: Editar Duración

# editDurationTypeLabel
source: Duration type
ca: Tipus de durada
es: Tipo de duración

# editDurationCurrentType
source: Current type: {type}
ca: Tipus actual: {type}
es: Tipo actual: {type}

# editDurationChangeTypeInfo
source: To change the duration type, edit the "Frequency" section
ca: Per canviar el tipus de durada, edita la secció de "Freqüència"
es: Para cambiar el tipo de duración, edita la sección de "Frecuencia"

# editDurationTreatmentDates
source: Treatment dates
ca: Dates del tractament
es: Fechas del tratamiento

# editDurationStartDate
source: Start date
ca: Data d'inici
es: Fecha de inicio

# editDurationEndDate
source: End date
ca: Data de fi
es: Fecha de fin

# editDurationNotSelected
source: Not selected
ca: No seleccionada
es: No seleccionada

# editDurationDays
source: Duration: {days} days
ca: Durada: {days} dies
es: Duración: {days} días

# editDurationSelectDates
source: Please select start and end dates
ca: Si us plau, selecciona les dates d'inici i fi
es: Por favor, selecciona las fechas de inicio y fin

# editDurationUpdated
source: Duration updated successfully
ca: Durada actualitzada correctament
es: Duración actualizada correctamente

# editDurationError
source: Error saving changes: {error}
ca: Error en desar canvis: {error}
es: Error al guardar cambios: {error}

# editFastingTitle
source: Edit Fasting Configuration
ca: Editar configuració de dejuni
es: Editar Configuración de Ayuno

# editFastingCompleteFields
source: Please complete all fields
ca: Si us plau, completa tots els camps
es: Por favor, completa todos los campos

# editFastingSelectWhen
source: Please select when the fasting is
ca: Si us plau, selecciona quan és el dejuni
es: Por favor, selecciona cuándo es el ayuno

# editFastingMinDuration
source: Fasting duration must be at least 1 minute
ca: La durada del dejuni ha de ser almenys 1 minut
es: La duración del ayuno debe ser al menos 1 minuto

# editFastingUpdated
source: Fasting configuration updated successfully
ca: Configuració de dejuni actualitzada correctament
es: Configuración de ayuno actualizada correctamente

# editFastingError
source: Error saving changes: {error}
ca: Error en desar canvis: {error}
es: Error al guardar cambios: {error}

# editFrequencyTitle
source: Edit Frequency
ca: Editar freqüència
es: Editar Frecuencia

# editFrequencyPattern
source: Frequency pattern
ca: Patró de freqüència
es: Patrón de frecuencia

# editFrequencyQuestion
source: How often will you take this medication?
ca: Amb quina freqüència prendràs aquest medicament?
es: ¿Con qué frecuencia tomarás este medicamento?

# editFrequencyEveryday
source: Every day
ca: Tots els dies
es: Todos los días

# editFrequencyEverydayDesc
source: Take the medication daily
ca: Prendre el medicament diàriament
es: Tomar el medicamento diariamente

# editFrequencyUntilFinished
source: Until finished
ca: Fins acabar
es: Hasta acabar

# editFrequencyUntilFinishedDesc
source: Until the medication runs out
ca: Fins que s'acabi el medicament
es: Hasta que se termine el medicamento

# editFrequencySpecificDates
source: Specific dates
ca: Dates específiques
es: Fechas específicas

# editFrequencySpecificDatesDesc
source: Select specific dates
ca: Seleccionar dates concretes
es: Seleccionar fechas concretas

# editFrequencyWeeklyDays
source: Days of the week
ca: Dies de la setmana
es: Días de la semana

# editFrequencyWeeklyDaysDesc
source: Select specific days each week
ca: Seleccionar dies específics cada setmana
es: Seleccionar días específicos cada semana

# editFrequencyAlternateDays
source: Alternate days
ca: Dies alternats
es: Días alternos

# editFrequencyAlternateDaysDesc
source: Every 2 days from treatment start
ca: Cada 2 dies des de l'inici del tractament
es: Cada 2 días desde el inicio del tratamiento

# editFrequencyCustomInterval
source: Custom interval
ca: Interval personalitzat
es: Intervalo personalizado

# editFrequencyCustomIntervalDesc
source: Every N days from start
ca: Cada N dies des de l'inici
es: Cada N días desde el inicio

# editFrequencySelectedDates
source: Selected dates
ca: Dates seleccionades
es: Fechas seleccionadas

# editFrequencyDatesCount
source: {count} dates selected
ca: {count} dates seleccionades
es: {count} fechas seleccionadas

# editFrequencyNoDatesSelected
source: No dates selected
ca: Cap data seleccionada
es: Ninguna fecha seleccionada

# editFrequencySelectDatesButton
source: Select dates
ca: Seleccionar dates
es: Seleccionar fechas

# editFrequencyWeeklyDaysLabel
source: Days of the week
ca: Dies de la setmana
es: Días de la semana

# editFrequencyWeeklyDaysCount
source: {count} days selected
ca: {count} dies seleccionats
es: {count} días seleccionados

# editFrequencyNoDaysSelected
source: No days selected
ca: Cap dia seleccionat
es: Ningún día seleccionado

# editFrequencySelectDaysButton
source: Select days
ca: Seleccionar dies
es: Seleccionar días

# editFrequencyIntervalLabel
source: Day interval
ca: Interval de dies
es: Intervalo de días

# editFrequencyIntervalField
source: Every how many days
ca: Cada quants dies
es: Cada cuántos días

# editFrequencyIntervalHint
source: E.g.: 3
ca: Ex: 3
es: Ej: 3

# editFrequencyIntervalHelp
source: Must be at least 2 days
ca: Ha de ser almenys 2 dies
es: Debe ser al menos 2 días

# editFrequencySelectAtLeastOneDate
source: Please select at least one date
ca: Si us plau, selecciona almenys una data
es: Por favor, selecciona al menos una fecha

# editFrequencySelectAtLeastOneDay
source: Please select at least one day of the week
ca: Si us plau, selecciona almenys un dia de la setmana
es: Por favor, selecciona al menos un día de la semana

# editFrequencyIntervalMin
source: Interval must be at least 2 days
ca: L'interval ha de ser almenys 2 dies
es: El intervalo debe ser al menos 2 días

# editFrequencyUpdated
source: Frequency updated successfully
ca: Freqüència actualitzada correctament
es: Frecuencia actualizada correctamente

# editFrequencyError
source: Error saving changes: {error}
ca: Error en desar canvis: {error}
es: Error al guardar cambios: {error}

# editQuantityTitle
source: Edit Quantity
ca: Editar quantitat
es: Editar Cantidad

# editQuantityMedicationLabel
source: Medication quantity
ca: Quantitat de medicament
es: Cantidad de medicamento

# editQuantityDescription
source: Set the available quantity and when you want to receive alerts
ca: Estableix la quantitat disponible i quan vols rebre alertes
es: Establece la cantidad disponible y cuándo deseas recibir alertas

# editQuantityAvailableLabel
source: Available quantity
ca: Quantitat disponible
es: Cantidad disponible

# editQuantityAvailableHelp
source: Amount of {unit} you currently have
ca: Quantitat de {unit} que tens actualment
es: Cantidad de {unit} que tienes actualmente

# editQuantityValidationRequired
source: Please enter the available quantity
ca: Si us plau, introdueix la quantitat disponible
es: Por favor, introduce la cantidad disponible

# editQuantityValidationMin
source: Quantity must be greater than or equal to 0
ca: La quantitat ha de ser major o igual a 0
es: La cantidad debe ser mayor o igual a 0

# editQuantityThresholdLabel
source: Alert when remaining
ca: Avisar quan en quedin
es: Avisar cuando queden

# editQuantityThresholdHelp
source: Days in advance to receive the low stock alert
ca: Dies d'antelació per rebre l'alerta d'estoc baix
es: Días de antelación para recibir la alerta de bajo stock

# editQuantityThresholdValidationRequired
source: Please enter the days in advance
ca: Si us plau, introdueix els dies d'antelació
es: Por favor, introduce los días de antelación

# editQuantityThresholdValidationMin
source: Must be at least 1 day
ca: Ha de ser almenys 1 dia
es: Debe ser al menos 1 día

# editQuantityThresholdValidationMax
source: Cannot be greater than 30 days
ca: No pot ser major a 30 dies
es: No puede ser mayor a 30 días

# editQuantityUpdated
source: Quantity updated successfully
ca: Quantitat actualitzada correctament
es: Cantidad actualizada correctamente

# editQuantityError
source: Error saving changes: {error}
ca: Error en desar canvis: {error}
es: Error al guardar cambios: {error}

# editScheduleTitle
source: Edit Schedules
ca: Editar horaris
es: Editar Horarios

# editScheduleAddDose
source: Add dose
ca: Afegir presa
es: Añadir toma

# editScheduleValidationQuantities
source: Please enter valid quantities (greater than 0)
ca: Si us plau, introdueix quantitats vàlides (majors a 0)
es: Por favor, ingresa cantidades válidas (mayores a 0)

# editScheduleValidationDuplicates
source: Dose times cannot be repeated
ca: Les hores de les preses no poden repetir-se
es: Las horas de las tomas no pueden repetirse

# editScheduleUpdated
source: Schedules updated successfully
ca: Horaris actualitzats correctament
es: Horarios actualizados correctamente

# editScheduleError
source: Error saving changes: {error}
ca: Error en desar canvis: {error}
es: Error al guardar cambios: {error}

# editScheduleDosesPerDay
source: Doses per day: {count}
ca: Preses al dia: {count}
es: Tomas al día: {count}

# editScheduleAdjustTimeAndQuantity
source: Adjust the time and quantity of each dose
ca: Ajusta l'hora i quantitat de cada presa
es: Ajusta la hora y cantidad de cada toma

# specificDatesSelectorTitle
source: Specific dates
ca: Dates específiques
es: Fechas específicas

# specificDatesSelectorSelectDates
source: Select dates
ca: Selecciona dates
es: Selecciona fechas

# specificDatesSelectorDescription
source: Choose the specific dates when you will take this medication
ca: Tria les dates específiques en què prendràs aquest medicament
es: Elige las fechas específicas en las que tomarás este medicamento

# specificDatesSelectorAddDate
source: Add date
ca: Afegir data
es: Añadir fecha

# specificDatesSelectorSelectedDates
source: Selected dates ({count})
ca: Dates seleccionades ({count})
es: Fechas seleccionadas ({count})

# specificDatesSelectorToday
source: TODAY
ca: AVUI
es: HOY

# specificDatesSelectorContinue
source: Continue
ca: Continuar
es: Continuar

# specificDatesSelectorAlreadySelected
source: This date is already selected
ca: Aquesta data ja està seleccionada
es: Esta fecha ya está seleccionada

# specificDatesSelectorSelectAtLeastOne
source: Select at least one date
ca: Selecciona almenys una data
es: Selecciona al menos una fecha

# specificDatesSelectorPickerHelp
source: Select a date
ca: Selecciona una data
es: Selecciona una fecha

# specificDatesSelectorPickerCancel
source: Cancel
ca: Cancel·lar
es: Cancelar

# specificDatesSelectorPickerConfirm
source: Accept
ca: Acceptar
es: Aceptar

# weeklyDaysSelectorTitle
source: Days of the week
ca: Dies de la setmana
es: Días de la semana

# weeklyDaysSelectorSelectDays
source: Select the days
ca: Selecciona els dies
es: Selecciona los días

# weeklyDaysSelectorDescription
source: Choose which days of the week you will take this medication
ca: Tria quins dies de la setmana prendràs aquest medicament
es: Elige qué días de la semana tomarás este medicamento

# weeklyDaysSelectorSelectedCount
source: {count} day{plural} selected
ca: {count} dia{plural} seleccionat{plural}
es: {count} día{plural} seleccionado{plural}

# weeklyDaysSelectorContinue
source: Continue
ca: Continuar
es: Continuar

# weeklyDaysSelectorSelectAtLeastOne
source: Select at least one day of the week
ca: Selecciona almenys un dia de la setmana
es: Selecciona al menos un día de la semana

# weeklyDayMonday
source: Monday
ca: Dilluns
es: Lunes

# weeklyDayTuesday
source: Tuesday
ca: Dimarts
es: Martes

# weeklyDayWednesday
source: Wednesday
ca: Dimecres
es: Miércoles

# weeklyDayThursday
source: Thursday
ca: Dijous
es: Jueves

# weeklyDayFriday
source: Friday
ca: Divendres
es: Viernes

# weeklyDaySaturday
source: Saturday
ca: Dissabte
es: Sábado

# weeklyDaySunday
source: Sunday
ca: Diumenge
es: Domingo

# dateFromLabel
source: From
ca: Des de
es: Desde

# dateToLabel
source: To
ca: Fins a
es: Hasta

# statisticsTitle
source: Statistics
ca: Estadístiques
es: Estadísticas

# adherenceLabel
source: Adherence
ca: Adherència
es: Adherencia

# emptyDosesWithFilters
source: No doses with these filters
ca: No hi ha preses amb aquests filtres
es: No hay tomas con estos filtros

# emptyDoses
source: No doses registered
ca: No hi ha preses registrades
es: No hay tomas registradas

source: Permission required
ca: Permís necessari
es: Permiso necesario

# notNowButton
source: Not now
ca: Ara no
es: Ahora no

# openSettingsButton
source: Open settings
ca: Obrir configuració
es: Abrir ajustes

# medicationUpdatedMsg
source: {name} updated
ca: {name} actualitzat
es: {name} actualizado

# noScheduledTimes
source: This medication has no scheduled times
ca: Aquest medicament no té horaris configurats
es: Este medicamento no tiene horarios configurados

# allDosesTakenToday
source: You've taken all doses for today
ca: Ja has pres totes les dosis d'avui
es: Ya has tomado todas las dosis de hoy

# registerDoseOfMedication
source: Register dose of {name}
ca: Registrar presa de {name}
es: Registrar toma de {name}

# refillMedicationTitle
source: Refill {name}
ca: Recarregar {name}
es: Recargar {name}

# doseRegisteredAt
source: Registered at {time}
ca: Registrada a les {time}
es: Registrada a las {time}

# statusUpdatedTo
source: Status updated to: {status}
ca: Estat actualitzat a: {status}
es: Estado actualizado a: {status}

# dateLabel
source: Date:
ca: Data:
es: Fecha:

# scheduledTimeLabel
source: Scheduled time:
ca: Hora programada:
es: Hora programada:

# currentStatusLabel
source: Current status:
ca: Estat actual:
es: Estado actual:

# changeStatusToQuestion
source: Change status to:
ca: Canviar estat a:
es: ¿Cambiar estado a:

source: Filter applied
ca: Filtre aplicat
es: Filtro aplicado

# filterFrom
source: From {date}
ca: Des de {date}
es: Desde {date}

# filterTo
source: To {date}
ca: Fins a {date}
es: Hasta {date}

# insufficientStockForDose
source: Insufficient stock to mark as taken
ca: No hi ha prou estoc per marcar com a presa
es: No hay suficiente stock para marcar como tomada

# settingsTitle
source: Settings
ca: Configuració
es: Configuración
