Repository: rafapoza/medicapp
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# settingsBackupSection
source: Backup & Restore
ca: Còpia de Seguretat
es: Copia de Seguridad

# settingsExportTitle
source: Export Database
ca: Exportar Base de Dades
es: Exportar Base de Datos

# settingsExportSubtitle
source: Save a copy of all your medications and history
ca: Desa una còpia de tots els teus medicaments i historial
es: Guarda una copia de todos tus medicamentos e historial

# settingsImportTitle
source: Import Database
ca: Importar Base de Dades
es: Importar Base de Datos

# settingsImportSubtitle
source: Restore a previously exported backup
ca: Restaura una còpia de seguretat prèviament exportada
es: Restaura una copia de seguridad previamente exportada

# settingsInfoTitle
source: Information
ca: Informació
es: Información

# settingsInfoContent
source: • When exporting, a backup file will be created that you can save on your device or share. • When importing, all current data will be replaced with the data from the selected file. • It is recommended to make backups regularly.
ca: • En exportar, es crearà un arxiu de còpia de seguretat que podràs desar al teu dispositiu o compartir. • En importar, totes les dades actuals seran reemplaçades per les de l'arxiu seleccionat. • Es recomana fer còpies de seguretat regularment.
es: • Al exportar, se creará un archivo de copia de seguridad que podrás guardar en tu dispositivo o compartir. • Al importar, todos los datos actuales serán reemplazados por los del archivo seleccionado. • Se recomienda hacer copias de seguridad regularmente.

# settingsShareText
source: MedicApp Database Backup
ca: Còpia de seguretat de MedicApp
es: Copia de seguridad de MedicApp

# settingsExportSuccess
source: Database exported successfully
ca: Base de dades exportada correctament
es: Base de datos exportada correctamente

# settingsImportSuccess
source: Database imported successfully
ca: Base de dades importada correctament
es: Base de datos importada correctamente

# settingsExportError
source: Export error: {error}
ca: Error en exportar: {error}
es: Error al exportar: {error}

# settingsImportError
source: Import error: {error}
ca: Error en importar: {error}
es: Error al importar: {error}

# settingsFilePathError
source: Could not get file path
ca: No s'ha pogut obtenir la ruta de l'arxiu
es: No se pudo obtener la ruta del archivo

# settingsImportDialogTitle
source: Import Database
ca: Importar Base de Dades
es: Importar Base de Datos

# settingsImportDialogMessage
source: This action will replace all your current data with the data from the imported file. Are you sure you want to continue?
ca: Aquesta acció reemplaçarà totes les teves dades actuals amb les dades de l'arxiu importat. Estàs segur de continuar?
es: Esta acción reemplazará todos tus datos actuales con los datos del archivo importado. ¿Estás seguro de continuar?

# settingsRestartDialogTitle
source: Import Completed
ca: Importació Completada
es: Importación Completada

# settingsRestartDialogMessage
source: The database has been imported successfully. Please restart the application to see the changes.
ca: La base de dades s'ha importat correctament. Si us plau, reinicia l'aplicació per veure els canvis.
es: La base de datos se ha importado correctamente. Por favor, reinicia la aplicación para ver los cambios.

# settingsRestartDialogButton
source: OK
ca: Entès
es: Entendido

# notificationsWillNotWork
source: Notifications will NOT work without this permission.
es: Las notificaciones NO funcionarán sin este permiso.

source: Debug menu activated
es: Menú de depuración activado

source: Debug menu deactivated
es: Menú de depuración desactivado

# nextDoseAt
source: Next dose: {time}
es: Próxima toma: {time}

# pendingDose
source: ⚠️ Pending dose: {time}
es: ⚠️ Dosis pendiente: {time}

# nextDoseTomorrow
source: Next dose: tomorrow at {time}
es: Próxima toma: mañana a las {time}

# nextDoseOnDay
source: Next dose: {dayName} {day}/{month} at {time}
es: Próxima toma: {dayName} {day}/{month} a las {time}

# dayNameMon
source: Mon
es: Lun

# dayNameTue
source: Tue
es: Mar

# dayNameWed
source: Wed
es: Mié

# dayNameThu
source: Thu
es: Jue

# dayNameFri
source: Fri
es: Vie

# dayNameSat
source: Sat
es: Sáb

# dayNameSun
source: Sun
es: Dom

source: Which dose did you take?
es: ¿Qué toma has tomado?

# insufficientStockForThisDose
source: Insufficient stock for this dose Needed: {needed} {unit} Available: {available}
es: Stock insuficiente para esta toma Necesitas: {needed} {unit} Disponible: {available}

# doseRegisteredAtTime
source: Dose of {name} registered at {time} Remaining stock: {stock}
es: Toma de {name} registrada a las {time} Stock restante: {stock}

# allDosesCompletedToday
source: ✓ All doses for today completed
es: ✓ Todas las tomas de hoy completadas

# remainingDosesToday
source: Remaining doses today: {count}
es: Tomas restantes hoy: {count}

# manualDoseRegistered
source: Manual dose of {name} registered Quantity: {quantity} {unit} Remaining stock: {stock}
es: Toma manual de {name} registrada Cantidad: {quantity} {unit} Stock restante: {stock}

# medicationSuspended
source: {name} suspended No more notifications will be scheduled
es: {name} suspendido No se programarán más notificaciones

# medicationReactivated
source: {name} reactivated Notifications rescheduled
es: {name} reactivado Notificaciones reprogramadas

# currentStock
source: Current stock: {stock}
es: Stock actual: {stock}

source: Quantity to add
es: Cantidad a agregar

# example
source: E.g.: {example}
es: Ej: {example}

# lastRefill
source: Last refill: {amount} {unit}
es: Última recarga: {amount} {unit}

# refillButton
source: Refill
es: Recargar

# stockRefilled
source: Stock of {name} refilled Added: {amount} {unit} New stock: {newStock}
es: Stock de {name} recargado Agregado: {amount} {unit} Nuevo stock: {newStock}

# availableStock
source: Available stock: {stock}
es: Stock disponible: {stock}

source: Quantity taken
es: Cantidad tomada

# registerButton
source: Register
es: Registrar

source: Register manual dose
es: Registrar toma manual

source: Refill medication
es: Recargar medicamento

source: Resume medication
es: Reactivar medicamento

source: Suspend medication
es: Suspender medicamento

# editMedicationButton
source: Edit medication
es: Editar medicamento

# deleteMedicationButton
source: Delete medication
es: Eliminar medicamento

# medicationDeletedShort
source: {name} deleted
es: {name} eliminado

source: No medications registered
es: No hay medicamentos registrados

# addMedicationHint
source: Press the + button to add one
es: Pulsa el botón + para añadir uno

# pullToRefresh
source: Pull down to refresh
es: Arrastra hacia abajo para recargar

# batteryOptimizationWarning
source: For notifications to work, disable battery restrictions:
es: Para que las notificaciones funcionen, desactiva las restricciones de batería:

# batteryOptimizationInstructions
source: Settings → Apps → MedicApp → Battery → "Unrestricted"
es: Ajustes → Aplicaciones → MedicApp → Batería → "Sin restricciones"

source: Open settings
es: Abrir ajustes

# todayDosesLabel
source: Today's doses:
es: Tomas de hoy:

# doseOfMedicationAt
source: Dose of {name} at {time}
es: Toma de {name} a las {time}

# currentStatus
source: Current status: {status}
es: Estado actual: {status}

source: What do you want to do?
es: ¿Qué deseas hacer?

# deleteButton
source: Delete
es: Eliminar

source: Mark as Skipped
es: Marcar Omitida

source: Mark as Taken
es: Marcar Tomada

# doseDeletedAt
source: Dose at {time} deleted
es: Toma de las {time} eliminada

# errorDeleting
source: Error deleting: {error}
es: Error al eliminar: {error}

# doseMarkedAs
source: Dose at {time} marked as {status}
es: Toma de las {time} marcada como {status}

# errorChangingStatus
source: Error changing status: {error}
es: Error al cambiar estado: {error}

# medicationUpdatedShort
source: {name} updated
es: {name} actualizado

# activateAlarmsPermission
source: Activate "Alarms & reminders"
es: Activar "Alarmas y recordatorios"

# alarmsPermissionDescription
source: This permission allows notifications to trigger exactly at the scheduled time.
es: Este permiso permite que las notificaciones salten exactamente a la hora configurada.

# notificationDebugTitle
source: Notification Debug
es: Debug de Notificaciones

# notificationPermissions
source: ✓ Notification permissions: {enabled}
es: ✓ Permisos de notificaciones: {enabled}

# exactAlarmsAndroid12
source: ⏰ Exact alarms (Android 12+): {enabled}
es: ⏰ Alarmas exactas (Android 12+): {enabled}

# importantWarning
source: ⚠️ IMPORTANT
es: ⚠️ IMPORTANTE

# withoutPermissionNoNotifications
source: Without this permission notifications will NOT trigger.
es: Sin este permiso las notificaciones NO saltarán.

# alarmsSettings
source: Settings → Apps → MedicApp → Alarms & reminders
es: Ajustes → Aplicaciones → MedicApp → Alarmas y recordatorios

source: 📊 Pending notifications: {count}
es: 📊 Notificaciones pendientes: {count}

# medicationsWithSchedules
source: 💊 Medications with schedules: {withSchedules}/{total}
es: 💊 Medicamentos con horarios: {withSchedules}/{total}

source: Scheduled notifications:
es: Notificaciones programadas:

source: ⚠️ No scheduled notifications
es: ⚠️ No hay notificaciones programadas

source: No title
es: Sin título

source: Medications and schedules:
es: Medicamentos y horarios:

source: ⚠️ No schedules configured
es: ⚠️ Sin horarios configurados

# closeButton
source: Close
es: Cerrar

source: Test notification
es: Probar notificación

source: Test notification sent
es: Notificación de prueba enviada

# testScheduledNotification
source: Test scheduled (1 min)
es: Probar programada (1 min)

# scheduledNotificationInOneMin
source: Notification scheduled for 1 minute
es: Notificación programada para 1 minuto

source: Reschedule notifications
es: Reprogramar notificaciones

# notificationsInfo
source: Notification info
es: Info de notificaciones

# notificationsRescheduled
source: Notifications rescheduled: {count}
es: Notificaciones reprogramadas: {count}

# yesText
source: Yes
es: Sí

# notificationTypeDynamicFasting
source: Dynamic fasting
es: Ayuno dinámico

# notificationTypeScheduledFasting
source: Scheduled fasting
es: Ayuno programado

# notificationTypeWeeklyPattern
source: Weekly pattern
es: Patrón semanal

# notificationTypeSpecificDate
source: Specific date
es: Fecha específica

# notificationTypePostponed
source: Postponed
es: Pospuesta

# notificationTypeDailyRecurring
source: Daily recurring
es: Diaria recurrente

source: Before taking
es: Antes de tomar

source: After taking
es: Después de tomar

source: Based on actual dose
es: Basado en toma real

source: Based on schedule
es: Basado en horario

# today
source: Today {day}/{month}/{year}
es: Hoy {day}/{month}/{year}

# tomorrow
source: Tomorrow {day}/{month}/{year}
es: Mañana {day}/{month}/{year}

source: Today or later
es: Hoy o posterior

# pastDueWarning
source: ⚠️ PAST DUE
es: ⚠️ PASADA

# batteryOptimizationMenu
source: ⚙️ Battery optimization
es: ⚙️ Optimización de batería

# alarmsAndReminders
source: ⚙️ Alarms & reminders
es: ⚙️ Alarmas y recordatorios

# notificationTypeScheduledFastingShort
source: Scheduled fasting
es: Ayuno programado

# basedOnActualDoseShort
source: Based on actual dose
es: Basado en toma real

# basedOnScheduleShort
source: Based on schedule
es: Basado en horario

# pendingNotifications
source: 📊 Pending notifications: {count}
es: 📊 Notificaciones pendientes: {count}

# medicationsWithSchedulesInfo
source: 💊 Medications with schedules: {withSchedules}/{total}
es: 💊 Medicamentos con horarios: {withSchedules}/{total}

# noSchedulesConfiguredWarning
source: ⚠️ No schedules configured
es: ⚠️ Sin horarios configurados

# notificationType
source: 📋 Type: {type}
es: 📋 Tipo: {type}

# scheduleDate
source: 📅 Date: {date}
es: 📅 Fecha: {date}

# scheduleTime
source: ⏰ Time: {time}
es: ⏰ Hora: {time}

# takenStatus
source: Taken
es: Tomada

# skippedStatus
source: Skipped
es: Omitida

# durationEstimate
source: {name} Stock: {stock} Estimated duration: {days} days
es: {name} Stock: {stock} Duración estimada: {days} días

# errorChanging
source: Error changing status: {error}
es: Error al cambiar estado: {error}

source: Test scheduled (1 min)
es: Probar programada (1 min)

# alarmsAndRemindersMenu
source: ⚙️ Alarms & reminders
es: ⚙️ Alarmas y recordatorios

# navPillOrganizerShort
source: Stock
ca: Estoc

# medicineCabinetStock
source: Stock:
ca: Estoc:

# takenTodaySingle
source: Taken today: {quantity} {unit} at {time}
ca: Pres avui: {quantity} {unit} a les {time}

# takenTodayMultiple
source: Taken today: {count} times ({quantity} {unit})
ca: Pres avui: {count} vegades ({quantity} {unit})

source: Done
ca: Fet

source: Suspended
ca: Suspès
